LTC0213/STM32_CERS/CERS0120/Src/main.c
/**
  ******************************************************************************
  * 文件名程: main.c 
  * 作    者: 李天宸
  * 版    本: V1.0
  * 编写日期: 2020-12-17
  * 功    能: CERS功能实现
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F4Pro使用。
  ******************************************************************************
  */
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "string.h"
#include "math.h"
// #include "usart/bsp_debug_usart.h"
#include "led/bsp_led.h"
#include "HMI/bsp_usartx_HMI.h"
#include "spiflash/bsp_spiweight.h"
#include "spiflash/bsp_spiflash.h"
#include "beep/bsp_beep.h"

#include "DCMotor/bsp_BDCMotor.h" 
#include "key/bsp_key.h"
#include "encoder/bsp_encoder.h"
#include "usart/bsp_usartx.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
#define HMI_RX_BUFFER_SIZE       30

#define  FLASH_WriteAddress      0x0000
#define  FLASH_SectorToErase    FLASH_WriteAddress

#define HMI_SECTOR_ADDREE       4096*2

/* 私有变量 ------------------------------------------------------------------*/
/* HMI串口变量 ------------------------------------------------------------------*/
__IO uint8_t  HMI_Rx_buf[HMI_RX_BUFFER_SIZE]={0};
__IO uint8_t  HMI_RX_flag=0;       //0:未接收到数据头  1：已经接收到数据头  2：一帧接收完毕
__IO uint8_t  usart_rx_flag;

__IO uint16_t timer_count=0;
__IO uint16_t pwm_data=0;
/* 通道选择变量 ------------------------------------------------------------------*/
__IO uint8_t  model_channelx=0;         //模式功能选择
__IO uint8_t  force_channelx=0;         //力传感器选择
__IO uint8_t  encoder_channelx=0;        //编码器选择
__IO uint8_t  force_modelx=0;         //动作选择
__IO uint8_t  encoder_modelx=0;        //动作选择
/* 力检测变量 ------------------------------------------------------------------*/
__IO uint8_t  weight_Zero_IsInit=0;     // 0：停止数据采集 1:零值未获取  2：已获取零值
__IO int32_t  weight_Zero_Data=0;       // 无施加力时零值记录值

__IO uint8_t  Is_thres_stamp=0;         //是否有阀值设定
__IO uint8_t  Is_tare_stamp=0;          //是否记录零值
__IO uint8_t  Is_start_stamp=0;          //开始测试

__IO int32_t  Record_weight = 0;           //预紧力值
__IO int32_t  Record_weight1;           //预紧力记录值（用于每次测力前记录零值） 
__IO int32_t  Record_weight2;           //预紧力记录值（用于每次测力前记录零值 ） 
__IO int32_t  cali_weight;              //校准使用
__IO int32_t  weight_proportion = 1950; //换算值记录 比例系数
__IO int32_t  weight_current;           //换算放大后力数值

__IO int32_t  second_count;             //皮重记录值
__IO int32_t  third_count;              //皮重记录值
__IO uint8_t  Force_Process_Step=0;   // 

__IO uint8_t  Test_Step=0;
/* 插补函数变量 ------------------------------------------------------------------*/
__IO int32_t  in0=0;
__IO int32_t  in1=0;
__IO int32_t  in2=0;
__IO int32_t  in3=0;
__IO int32_t  in4=0;

/* 插补函数变量 ------------------------------------------------------------------*/
__IO int32_t  average=0;
__IO int32_t  maximum=0;
__IO int32_t  standard_deviation=0;//标准差
__IO int16_t  coefficient_variation=0;
__IO int32_t  maximum_record1=0;
__IO int32_t  maximum_record2=0;
__IO int32_t  maximum_record3=0;
__IO int16_t  record_count=0;

/* 角度检测变量 ------------------------------------------------------------------*/
// __IO int32_t CaptureNumber = 0;     // 输入捕获数
// __IO int32_t LastCapNum = 0;     // 上一次输入捕获数
// __IO int32_t Speed = 0;     // 上一次输入捕获数
__IO int32_t Angle = 0;      // 角度
__IO int32_t ENCODER_RESOLUTION = 0;

__IO uint8_t  encoder_Zero_IsInit=0;     // 0：停止数据采集 1:零值未获取  2：已获取零值
__IO int32_t  encoder_Zero_Data=0;       // 无施加力时零值记录值
__IO uint8_t  Encoder_Process_Step=0;   // 
__IO int32_t  Record_encoder = 0;        //预紧角度值
__IO int32_t  Record_encoder1;           //预紧角度记录值（用于每次测角度前记录零值） 
__IO int32_t  Record_encoder2;           //预紧角度记录值（用于每次测角度前记录零值 ）
__IO int64_t  data_temp,temp;
__IO int32_t  encoder_read;
__IO int32_t  encoder_read_before;
/* SPI flash变量 ------------------------------------------------------------------*/
uint32_t DeviceID = 0;
uint32_t FlashID = 0;
uint8_t Tx_Buffer[3] = {0};
uint8_t Rx_Buffer[3] = {0};
int32_t Result_data=0;


__IO int32_t timecount = 0;
/* 扩展变量 ------------------------------------------------------------------*/
extern __IO uint32_t uwTick;  //时钟计数
extern int32_t XOverflowCount ;//定时器溢出次数 
extern int32_t YOverflowCount ;//定时器溢出次数 

/* 私有函数原形 --------------------------------------------------------------*/
void HMI_value_setting(const char *val_str,uint32_t value);
void HMI_string_setting(const char *val_str,int32_t value);
unsigned int ENCODER_read_channelx(int8_t channelx);

/* 函数体 --------------------------------------------------------------------*/
/**
  * 函数功能: 系统时钟配置
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
 
  __HAL_RCC_PWR_CLK_ENABLE();                                     //使能PWR时钟

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);  //设置调压器输出电压级别1

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;      // 外部晶振，8MHz
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;                        //打开HSE 
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;                    //打开PLL
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;            //PLL时钟源选择HSE
  RCC_OscInitStruct.PLL.PLLM = 8;                                 //8分频MHz
  RCC_OscInitStruct.PLL.PLLN = 336;                               //336倍频
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;                     //2分频，得到168MHz主时钟
  RCC_OscInitStruct.PLL.PLLQ = 7;                                 //USB/SDIO/随机数产生器等的主PLL分频系数
  HAL_RCC_OscConfig(&RCC_OscInitStruct);

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;       // 系统时钟：168MHz
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;              // AHB时钟： 168MHz
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;               // APB1时钟：42MHz
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;               // APB2时钟：84MHz
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);

